---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainUnsortableBucket
source: html/a2243b2f-5eed-78ff-fe2c-57f72ea2b33b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainUnsortableBucket Property

The chains formed by these curve elements cannot be ordered consistently in the their grid interval and will be ignored

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceCurveChainUnsortableBucket { get; }
```